{"config": [{"config": {"padding": [[1, 1], [1, 1]], "dtype": "float32", "batch_input_shape": [null, 150, 150, 3], "name": "zero_padding2d_1", "trainable": true, "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"config": {"kernel_size": [3, 3], "data_format": "channels_last", "filters": 16, "bias_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "padding": "valid", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "name": "conv2d_1", "bias_constraint": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "zero_padding2d_2", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"kernel_size": [3, 3], "data_format": "channels_last", "filters": 16, "bias_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "padding": "valid", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "name": "conv2d_2", "bias_constraint": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "zero_padding2d_3", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"kernel_size": [3, 3], "data_format": "channels_last", "filters": 16, "bias_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "padding": "valid", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "name": "conv2d_3", "bias_constraint": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "zero_padding2d_4", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"kernel_size": [3, 3], "data_format": "channels_last", "filters": 32, "bias_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "padding": "valid", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "name": "conv2d_4", "bias_constraint": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "zero_padding2d_5", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"kernel_size": [3, 3], "data_format": "channels_last", "filters": 32, "bias_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "padding": "valid", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "name": "conv2d_5", "bias_constraint": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_4", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "zero_padding2d_6", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"kernel_size": [3, 3], "data_format": "channels_last", "filters": 32, "bias_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "padding": "valid", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "name": "conv2d_6", "bias_constraint": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "zero_padding2d_7", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"kernel_size": [3, 3], "data_format": "channels_last", "filters": 64, "bias_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "padding": "valid", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "name": "conv2d_7", "bias_constraint": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_5", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "name": "dense_1", "units": 50, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "name": "dense_2", "units": 1, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}], "keras_version": "2.0.0", "backend": "tensorflow", "class_name": "Sequential"}